{
  "nodes": [
    {
      "op": "null", 
      "name": "ngram_features-2yW4Acq9GF", 
      "attrs": {"__storage_type__": "2"}, 
      "inputs": []
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label_Item_Weight_weight", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "label_Item_Weight_bias", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "label_Item_Weight", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Item_Weight", 
      "inputs": []
    }, 
    {
      "op": "elemwise_sub", 
      "name": "_minus0", 
      "inputs": [[4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "_power_scalar", 
      "name": "_powerscalar0", 
      "attrs": {"scalar": "2.0"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum0", 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean0", 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar0", 
      "attrs": {"scalar": "1e-05"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div0", 
      "inputs": [[8, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum1", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar1", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum0", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul0", 
      "inputs": [[13, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss0", 
      "attrs": {
        "normalization": "valid", 
        "valid_thresh": "1e-06"
      }, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "pred-Item_Weight", 
      "inputs": [[4, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 2, 3, 5], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19
  ], 
  "heads": [[17, 0, 0], [18, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10700]}
}